In [1]:
# 전처리 : 머신러닝 모델에 훈련 데이터를 입력하기전에 데이터를 가공
# 머신러닝 기초수식   y = f(x)
# x: 훈련데이터(train data)  테스트데이터 둘다 동일한 feature를 가져야함

In [2]:
# 열(column) :  특성(feature), 속성(attribute), 변수(variable), field
# 행(row) : 개체(instance), 관측치(observed value), 기록(record),사례(example),경우(case)

In [3]:
# 데이터 품질의 문제...
# 1. 연속형 값 : 최대값과 최소값의 차이가 피처보다 많이 나는경우 
# 학습에 영향을 주기때문에 데이터의 스케일을 맞춰줌(scale)
# - 최대값과 최소값을 0 ~ 1사이의 가빗으로 바꾸거나 표준 정규분포형태로 나타냄

# 결측치(missing data)
# 1. 해당 데이터를 빼고 모델링을 한다.(데이터가 충분히 많은경우)
# 2. 너무 없을때는 .채워넣어서 모델링 - 평균,최빈값, 중간값

# 이상치 : 극단적으로 크거나 작을때

In [4]:
import pandas as pd
import numpy as np

raw_data = {'first_name': ['Jason', np.nan, 'Tina', 'Jake', 'Amy'], 
            'last_name': ['Miller', np.nan, 'Ali', 'Milner', 'Cooze'], 
            'age': [42, np.nan, 36, 24, 73], 
            'sex': ['m', np.nan, 'f', 'm', 'f'], 
            'preTestScore': [4, np.nan, np.nan, 2, 3],
            'postTestScore': [25, np.nan, np.nan, 62, 70]}

df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'sex', 'preTestScore', 'postTestScore'])
df

  first_name last_name   age  sex  preTestScore  postTestScore
0      Jason    Miller  42.0    m           4.0           25.0
1        NaN       NaN   NaN  NaN           NaN            NaN
2       Tina       Ali  36.0    f           NaN            NaN
3       Jake    Milner  24.0    m           2.0           62.0
4        Amy     Cooze  73.0    f           3.0           70.0

In [5]:
# 결측치 찾는다.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   first_name     4 non-null      object
 1   last_name      4 non-null      object
 2   age            4 non-null      float64
 3   sex            4 non-null      object
 4   preTestScore   3 non-null      float64
 5   postTestScore  3 non-null      float64
dtypes: float64(3), object(3)
memory usage: 368.0+ bytes

In [6]:
df.isnull().sum() / len(df)

first_name       0.2
last_name        0.2
age              0.2
sex              0.2
preTestScore     0.4
postTestScore    0.4
dtype: float64

In [7]:
df

  first_name last_name   age  sex  preTestScore  postTestScore
0      Jason    Miller  42.0    m           4.0           25.0
1        NaN       NaN   NaN  NaN           NaN            NaN
2       Tina       Ali  36.0    f           NaN            NaN
3       Jake    Milner  24.0    m           2.0           62.0
4        Amy     Cooze  73.0    f           3.0           70.0

In [8]:
df_no_na =  df.dropna()
df_no_na

  first_name last_name   age sex  preTestScore  postTestScore
0      Jason    Miller  42.0   m           4.0           25.0
3       Jake    Milner  24.0   m           2.0           62.0
4        Amy     Cooze  73.0   f           3.0           70.0

In [9]:
df.dropna(how='all')

  first_name last_name   age sex  preTestScore  postTestScore
0      Jason    Miller  42.0   m           4.0           25.0
2       Tina       Ali  36.0   f           NaN            NaN
3       Jake    Milner  24.0   m           2.0           62.0
4        Amy     Cooze  73.0   f           3.0           70.0

In [10]:
df.dropna(how='any')

  first_name last_name   age sex  preTestScore  postTestScore
0      Jason    Miller  42.0   m           4.0           25.0
3       Jake    Milner  24.0   m           2.0           62.0
4        Amy     Cooze  73.0   f           3.0           70.0

In [11]:
df['location'] = np.nan
df

  first_name last_name   age  sex  preTestScore  postTestScore  location
0      Jason    Miller  42.0    m           4.0           25.0       NaN
1        NaN       NaN   NaN  NaN           NaN            NaN       NaN
2       Tina       Ali  36.0    f           NaN            NaN       NaN
3       Jake    Milner  24.0    m           2.0           62.0       NaN
4        Amy     Cooze  73.0    f           3.0           70.0       NaN

In [13]:
df.dropna(how='all' ,axis = 1)

  first_name last_name   age  sex  preTestScore  postTestScore
0      Jason    Miller  42.0    m           4.0           25.0
1        NaN       NaN   NaN  NaN           NaN            NaN
2       Tina       Ali  36.0    f           NaN            NaN
3       Jake    Milner  24.0    m           2.0           62.0
4        Amy     Cooze  73.0    f           3.0           70.0

In [14]:
copy_df = df

In [20]:
df.dropna(how='all', axis=1, inplace=True)

In [21]:
df

  first_name last_name   age  sex  preTestScore  postTestScore
0      Jason    Miller  42.0    m           4.0           25.0
1        NaN       NaN   NaN  NaN           NaN            NaN
2       Tina       Ali  36.0    f           NaN            NaN
3       Jake    Milner  24.0    m           2.0           62.0
4        Amy     Cooze  73.0    f           3.0           70.0

In [24]:
# thresh 데이터의 개수를 기준으로 삭제
# thresh = 1 데이터가 한개라도 존재하는 행은 남김
# thresh = 5 데이터가 5개 이상이어야 남긴다
df.dropna(axis=0,thresh=1)
df.dropna(how='all',axis = 0)

  first_name last_name   age sex  preTestScore  postTestScore
0      Jason    Miller  42.0   m           4.0           25.0
2       Tina       Ali  36.0   f           NaN            NaN
3       Jake    Milner  24.0   m           2.0           62.0
4        Amy     Cooze  73.0   f           3.0           70.0

In [25]:
df.dropna(axis=0,thresh=5)

  first_name last_name   age sex  preTestScore  postTestScore
0      Jason    Miller  42.0   m           4.0           25.0
3       Jake    Milner  24.0   m           2.0           62.0
4        Amy     Cooze  73.0   f           3.0           70.0

In [28]:
# fillna : 빈 값을 채우기
df.fillna(0)

  first_name last_name   age sex  preTestScore  postTestScore
0      Jason    Miller  42.0   m           4.0           25.0
1          0         0   0.0   0           0.0            0.0
2       Tina       Ali  36.0   f           0.0            0.0
3       Jake    Milner  24.0   m           2.0           62.0
4        Amy     Cooze  73.0   f           3.0           70.0

In [32]:
# 모든 na을 일괄 처리하는 것보다는 컬럼별 평균값등으로 해당 컬럼의 na를 채운다
df['preTestScore'].fillna(df['preTestScore'].mean(), inplace=True)
df

  first_name last_name   age  sex  preTestScore  postTestScore
0      Jason    Miller  42.0    m           4.0           25.0
1        NaN       NaN   NaN  NaN           3.0            NaN
2       Tina       Ali  36.0    f           3.0            NaN
3       Jake    Milner  24.0    m           2.0           62.0
4        Amy     Cooze  73.0    f           3.0           70.0

In [34]:
# 열별 분포를 고려해서 채울수 있음
df.groupby('sex')['postTestScore'].transform('mean')

0    43.5
1     NaN
2    70.0
3    43.5
4    70.0
Name: postTestScore, dtype: float64

In [35]:
# 일반적인 사용 방법은  transform을 사용하여 인덱스기바니으로 채운다
df['postTestScore'].fillna(
   df.groupby('sex')['postTestScore'].transform('mean') ,inplace=True
)
df

  first_name last_name   age  sex  preTestScore  postTestScore
0      Jason    Miller  42.0    m           4.0           25.0
1        NaN       NaN   NaN  NaN           3.0            NaN
2       Tina       Ali  36.0    f           3.0           70.0
3       Jake    Milner  24.0    m           2.0           62.0
4        Amy     Cooze  73.0    f           3.0           70.0

In [36]:
# 범주형 데이터 전처리
# 서울 대전 대구 부산...
# [0,0,0,1]    [0,0,1,0]    
# 원핫인코딩(one-hot encording)
# color = {Green, Blue, Yellow}  인덱스를 0 1 2
#[1,0,0]  [0,1,0] [0,0,1]

In [37]:
# 판다스에서 제공하는 get_dummies함수  또는 scikit-learn  LebelEncoder, OneHotEncoder를 사용

In [39]:
edges =  pd.DataFrame(
    {
        'source':[0,1,2],
        'target':[2,2,3],
        'weight':[3,4,5],
        'color':['red','blue','blue']
    }
)
edges

   source  target  weight color
0       0       2       3   red
1       1       2       4  blue
2       2       3       5  blue

In [41]:
edges.dtypes

source     int64
target     int64
weight     int64
color     object
dtype: object

In [42]:
pd.get_dummies(edges)

   source  target  weight  color_blue  color_red
0       0       2       3           0          1
1       1       2       4           1          0
2       2       3       5           1          0

In [43]:
pd.get_dummies(edges['color'])

   blue  red
0     0    1
1     1    0
2     1    0

In [44]:
pd.get_dummies(edges[['color']])

   color_blue  color_red
0           0          1
1           1          0
2           1          0

In [45]:
# weight 는 원래 범주형인데... 수치로 되어 있는 사실상  기수형 데이터
# M L XL로 되어 있었기 때문에 해당 문자로 변환하고 one-hot incording

In [47]:
weight_dic = {3:'M', 4:'L', 5:'XL'}
edges['weight_sign'] = edges['weight'].map(weight_dic)
edges

   source  target  weight color weight_sign
0       0       2       3   red           M
1       1       2       4  blue           L
2       2       3       5  blue          XL

In [49]:
weight_sign =  pd.get_dummies(edges['weight_sign'])
weight_sign

   L  M  XL
0  0  1   0
1  1  0   0
2  0  0   1

In [53]:
df =  pd.concat([edges,pd.get_dummies(edges['color']),weight_sign], axis=1)
df

   source  target  weight color weight_sign  blue  red  L  M  XL
0       0       2       3   red           M     0    1  0  1   0
1       1       2       4  blue           L     1    0  1  0   0
2       2       3       5  blue          XL     1    0  0  0   1

In [57]:
# 수치형 데이터를 빈도수를 조사해 보면... 범주형 데이터인지 추측이 가능
df['weight'].value_counts()

3    1
4    1
5    1
Name: weight, dtype: int64

In [ ]:
#